# SetGroupTypeId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterDownloadOptions..::..SetGroupTypeId Method
ParameterDownloadOptions Class See Also
---
Set properties palette group identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public void SetGroupTypeId(
	ForgeTypeId groupTypeId
)
```

Visual Basic
---
```text
Public Sub SetGroupTypeId ( _
	groupTypeId As ForgeTypeId _
)
```

Visual C++
---
```text
public:
void SetGroupTypeId(
	ForgeTypeId^ groupTypeId
)
```

# ### Parameters
groupTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace